app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
  def new
    @chats = Chat.all

INSERT INTO "chats" ("name", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dude "], ["message", "something"], ["created_at", "2016-07-12 04:05:20.397844"], ["updated_at", "2016-07-12 04:05:20.397844"]]
---
  def create
    @chat = Chat.new(chat_params)

    respond_to do |format|
      if @chat.save

DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]
---
  def destroy
    @chat.destroy

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_chat
      @chat = Chat.find(params[:id])